use MovieDB;
insert into movie (`Name`,poster,stealScene,genre,releaseDate,country,runTime,director,actor,story1,important,story2)
values ('기생충','https://movie-phinf.pstatic.net/20190528_36/1559024198386YVTEw_JPEG/movie_image.jpg'
        ,'https://movie-phinf.pstatic.net/20181023_176/1540258143327jcNEc_JPEG/movie_image.jpg?type=m427_320_2'
        ,'드라마','2019-05-30','한국','131분','봉준호','송강호, 이선균, 조여정, ...'
        ,'전원백수로 살 길 막막하지만 사이는 좋은 기택(송강호) 가족. 
        장남 기우(최우식)에게 명문대생 친구가 연결시켜 준 고액 과외 자리는 
        모처럼 싹튼 고정수입의 희망이다. 
        온 가족의 도움과 기대 속에 박사장(이선균) 집으로 향하는 기우. 
        글로벌 IT기업 CEO인 박사장의 저택에 도착하자 
        젊고 아름다운 사모님 연교(조여정)가 기우를 맞이한다. 
        
        그러나 이렇게 시작된 두 가족의 만남 뒤로, 걷잡을 수 없는 사건이 기다리고 있었으니…'
        ,'“폐 끼치고 싶진 않았어요”'
        ,'극과 극의 삶을 사는 두 가족의 만남이 빚어낸 신선한 스토리 
        “같이 잘 살면 안 될까요?” 
        공생이 어려워진 각박한 시대를 살아가는 사람들의 이야기 
        봉준호 감독은 <기생충>에서 전작을 통틀어 최초로 가족 구성원을 부모와 자녀가 다 함께 있는 형태로 설정했다. 또한 봉준호 감독의 작품 중 지금, 여기라는 시공간적 특성이 가장 중요하게 고려된 영화다. 주인공들은 지금 여기, 마치 우리 옆집이나 옆 동네에 살고 있을 것만 같은 두 가족이다. 이 두 가족은 부모와 자녀로 이뤄진 4인 구성이라는 닮은 점도 있지만 그 삶의 형편은 그야말로 극과 극이라 일상에서 만날 일도 엮일 일도 없어 보인다. 그러나 ‘과외 면접’이라는 상황이 주어지면서 두 가족 사이에 연결점이 생기고, 예측 불가능한 만남이 시작된다. 
        돌이켜보면 봉준호 감독의 영화는 언제나 현시대에 대한 이야기였다. <설국열차>에서는 부와 권력에 따라 서열화된 우리 시대 계급 문제가 보였고, <옥자>에서는 공장식 축산 시대 속에 고통받는 동물들의 문제가 있었다. 
        그런 그가 <기생충>에 등장시킨 주인공은 도저히 만날 일 없어 보이는 극과 극의 삶의 조건을 가진 ‘두 가족’이다. ‘어설픈 의도’와 ‘몇 번의 우연들’이 겹치며 예측불허의 상황으로 빠져드는 두 가족의 운명은 공생(共生)을 꿈꾸는 것 자체가 점차 공상(空想)이 되어가는 현대 사회의 자화상을 보여준다. 

        영화 <기생충>에는 악인이 등장하지 않는다는 점도 눈여겨볼 만하다. 두 가족의 충돌이 매번 예측할 수 없는 사건들을 터트리며 관객들에게 웃음과 슬픔을 선사하지만 <기생충> 인물 그 누구도 악한 의도를 가지고 있지 않다. 
        우리는 항상 상생 또는 공생을 바란다. 하지만 그것이 쉽지 않다는 것 또한 느낀다. 그것은 개인의 의지나 잘잘못과 무관한 것이 되었다. 봉준호 감독은 현재의 자본주의 사회를 살아가고 있는 우리에게 ‘함께 잘 산다’는 것에 대해 그만의 방식으로 질문을 던진다. '),
	   ('악인전','https://movie-phinf.pstatic.net/20190515_203/1557888285764Rvouz_JPEG/movie_image.jpg'
        ,'https://movie-phinf.pstatic.net/20190405_291/1554425744948DCBTF_JPEG/movie_image.jpg?type=m427_320_2'
        ,'범죄, 액션','2019-05-15','한국','110분','이원태','마동석, 김무열, 김성규, ...'
        ,'우연히 연쇄살인마의 표적이 되었다 살아난 조직 보스 장동수와 
        범인잡기에 혈안이 된 강력반 미친개 정태석. 
        타협할 수 없는 두 사람이 연쇄살인마 K를 잡기 위해 손잡는다. '
        ,'표적은 하나, 룰도 하나!
        먼저 잡는 놈이 갖는다!'
        ,'영화 <악인전>은 조직 보스와 강력반 형사, 결코 타협할 수 없는 이들이 공통의 목표를 위해 손잡는 흥미로운 설정에서 시작한다. 중부권을 장악한 조직의 보스가 접촉사고를 가장해 접근한 남자에게 공격당한다. 건드리지 말아야 할 상대를 공격한 남자는 사라지고, 졸지에 피해자가 된 조직 보스는 분노로 들끓는다. 연쇄살인을 확신하고 홀로 사건을 추적하던 강력계 형사는 또 다른 검거 대상이었던 조직 보스와 손을 잡는다. 그가 연쇄살인의 유일한 생존자이자 목격자이자 증거였으므로.
        <악인전>의 가장 흥미로운 부분은 바로 이것이다. 악인으로 상징되는 조직 보스가 한 순간에 피해자가 되고, 선인으로 상징되는 형사는 가장 큰 악인을 잡기 위해 악인과 손잡는 것도 아랑곳하지 않는다. 형사와 함께 사건을 해결하려고 조직을 총동원하는 보스, 조직의 도움을 받아 연쇄살인의 정보를 빠르고 효과적으로 수집하는 형사, 결코 타협할 수 없는 두 사람은 서로의 능력을 최대치로 이용해 연쇄살인마를 바짝 쫓는다. 먼저 잡는 사람이 놈을 갖는다는 조건을 내건 채. 서로를 이용하지만 서로에 대한 경계를 늦추지 않는 두 사람, 둘은 과연 각자의 목적을 달성할 수 있을까. 절대 악을 잡기 위해 함께 할 수 없는 두 사람이 손잡아야 하는 모순적 상황이 주는 긴장과 예측할 수 없이 전개되는 드라마가 한시도 관객들의 눈을 뗄 수 없게 만든다. 신선한 설정과 강렬한 캐릭터, 짜릿한 액션을 선사할 5월 단 하나의 범죄 액션 영화 <악인전>이 관객과 만날 만반의 준비를 마쳤다. '),
       ('0.0MHz','https://movie-phinf.pstatic.net/20190517_285/15580610094800liOI_JPEG/movie_image.jpg'
        ,'https://movie-phinf.pstatic.net/20190514_92/1557793792300Pvpcu_JPEG/movie_image.jpg?type=m427_320_2'
        ,'공포','2019-05-29','한국','102분','유선동','정은지, 이성열, 최윤영, ...'
        ,'에디슨의 마지막 발명품, 유령 탐지기?
        가지 말라는 곳에 가야 하는 이유가 있다
        세상에 일어나는 초자연 미스터리를 분석하는 동아리 0.0MHz 멤버들이 귀신을 부르는 주파수를 증명하기 위해 우하리의 한 흉가를 찾은 후 기이한 현상이 멈추지 않는데…'
        ,'“증명할 수 없는 미스터리란 없다”'
        ,'0.0MHz는 초자연 미스터리 동아리 멤버들이 귀신을 부르는 주파수를 증명하기 위해 우하리의 한 흉가를 찾은 후 벌어지는 기이한 현상을 다루는 공포영화로 2019년 첫 한국 공포영화로서 더욱 주목 받고 있다. 
        동명의 인기 웹툰을 원작으로 한 이 작품은 2012년 공개되어 대한민국을 공포로 몰아넣었고 2018년 ‘곤지암’ 탄생의 시초이자 모티브가 된 동명 웹툰 ‘0.0MHz’를 원작으로 오리지널리티를 강조해 선보인다. 
        실제 에디슨의 마지막 발명품이 유령 탐지기였을 정도로 과학의 신마저 밝히려 했던 귀신이 실제로 존재하는 것인지에 대해 의문을 제기하면서 흥미를 이끌어낸다. 인간 뇌파의 주파수가 0.0MHz가 되면 귀신을 만날 수 있는지에 대한 신선한 컨셉과 접신이라도 된 듯한 배우들의 열연 등 기존 한국 공포영화들과는 다른 방식의 공포를 예고해 기대를 높인다.'),
       ('알라딘','https://movie-phinf.pstatic.net/20190524_104/1558663170174Q2mmw_JPEG/movie_image.jpg'
       ,'https://movie-phinf.pstatic.net/20190417_212/1555463319238lklmS_JPEG/movie_image.jpg?type=m427_320_2'
       ,'모험, 가족, 판타지','2019-05-23','미국','128분','가이 리치','메나 마수드, 윌 스미스, 나오미 스콧, ...'
       ,'머나먼 사막 속 신비의 아그라바 왕국의 시대. 
       좀도둑 ‘알라딘’은 마법사 ‘자파’의 의뢰로 마법 램프를 찾아 나섰다가 
       주인에게 세 가지 소원을 들어주는 지니를 만나게 되고, 
       자스민 공주의 마음을 얻으려다 생각도 못했던 모험에 휘말리게 되는데…'
       ,'2016년 <정글북>, 2017년 <미녀와 야수> 
       디즈니 라이브 액션의 새로운 패러다임이 될 <알라딘>'
       ,'영화 <알라딘>은 좀도둑에 지나지 않았던 알라딘이 우연히 소원을 들어주는 램프의 요정 지니를 만나게 되면서 환상적인 모험을 겪게 되는 판타지 어드벤처 영화. 지금까지 디즈니 라이브 액션은 디즈니 클래식 2D 애니메이션 중에서도 가장 큰 사랑을 받았던 작품들을 실사화 하며, 세대와 성별, 국가를 뛰어넘는 보편적인 재미와 가치를 추구해왔다. 2016년 <정글북>은 모든 출연 동물들을 CGI 기술력으로 완성했으며, 보는 이로 하여금 실제 동물인 듯한 착각이 들 정도의 경이로운 정글 속 모험을 선사했다. <미녀와 야수>는 디즈니 사상 가장 아름다운 사랑이야기를 스크린에 옮겨내며 환상적인 경험을 선사한 바 있다. 두 작품 모두 실사화 과정 속에 감동, 경이로움이 두 배가 되는 만족도를 일군 작품. <알라딘> 역시 1992년 동명의 2D 애니메이션을 실사화 하면서 디즈니 라이브 액션의 새로운 패러다임을 제시 할 예정이다. '),
       ('어벤져스: 엔드게임','https://movie-phinf.pstatic.net/20190417_250/1555465284425i6WQE_JPEG/movie_image.jpg'
        ,'https://movie-phinf.pstatic.net/20190423_5/1555994334534o2NGj_JPEG/movie_image.jpg?type=m427_320_2'
        ,'액션, SF','2019-04-24','미국','181분','안소니 루소, 조 루소','로버트 다우니 주니어, 크리스 에반스, 마크 러팔로, ...'
        ,'인피니티 워 이후 절반만 살아남은 지구
        마지막 희망이 된 어벤져스
        먼저 떠난 그들을 위해 모든 것을 걸었다!
        
        위대한 어벤져스
        운명을 바꿀 최후의 전쟁이 펼쳐진다!'
        ,'<어벤져스>시리즈 대망의 마지막 내한 피날레!'
        ,'영화 <어벤져스: 엔드게임>이 전세계 영화 흥행 역사를 다시 한번 갈아치울 전망이다. 전 세계 최강의 화제작 영화 <어벤져스: 엔드게임>은 인피니티 워 이후, 지구의 마지막 희망이 된 살아남은 어벤져스 조합과 빌런 타노스의 최강 전투를 그린 영화. <아이언맨>(2008)을 시작으로 펼쳐진 약 10년에 걸친 마블 시네마틱 유니버스 대장정의 피날레 <어벤져스: 엔드게임>이 드디어 베일을 벗었다. ');
        
select * from movieshow 
where No = 1;
# ALTER USER 'root'@'localhost' IDENTIFIED WITH mysql_native_password BY 'N@mghcjf616';

insert into keyword(Keyword, Count, Movie, evaluation) values ('충격',1, 1, true)
on duplicate key update keyword = '충격', Count = Count+1, Movie = 1, evaluation = true;
select * from keyword;

select * from keyword 
where Movie=1 and evaluation = 1 order by Count DESC limit 20;

insert into Comment(ID, pw, Movie, evaluation, Comment)
values ('user1','1234',1,true,'재미있어요'),('user_Abc','1234',1,true,'인생영화입니다.')
      ,('hahahah','1234',1,true,'여운을 남기네요'),('Anonymous','1234',1,false,'스토리 별로인듯')
      ,('KKKKKKK','1234',1,false,'잔인한데 이게 15세라고?');
      
select count(No) from Comment
where evaluation = 0